<?php
    $api_error=array(

        'login'=>array(
                        '10000'=>'登录成功',
                        '10001'=>'用户名不存在',
                        '10002'=>'密码错误',
                        '10003'=>'内部错误-用户登录错误10003'
                      ),

        'register'=>array(
                        '10010'=>'注册成功',
                        '10011'=>'用户名不合法',
                        '10012'=>'包含要允许注册的词语',
                        '10013'=>'用户名已经存在',
                        '10014'=>'Email 格式有误',
                        '10015'=>'Email 不允许注册',
                        '10016'=>'该 Email 已经被注册',
                        '10017'=>'注册 内部错误',
                        '10018'=>'填写参数不正确'
                         ),

        'card'=>array(
                        '10020'=>'获取成功',
                        '10021'=>'参数不正确', 
                         ),

		'event'=>array(
                        '10501'=>'报名成功ok',
                        '10502'=>'获取成功ok', 
                        '10503'=>'no data', 
                         ),
    );

?>